# Написать функцию thesaurus(), принимающую в качестве аргументов имена сотрудников и
# возвращающую словарь, в котором ключи — первые буквы имён, а значения — списки,
# содержащие имена, начинающиеся с соответствующей буквы

# def thesaurus():
# for i in thesaurus:
# dictionary = {}
# word = i
# print(i)
# idx = word[0]
# print(idx)
# dictionary[idx] = [i]


